import { cookingCourseImg, fastfoodCourseImg, beverageCourseImg, breadBakingCourseImg, bakingCourseImg, baklavaCourseImg } from '../images/courses';

export const cookingCourse = {
  id: 1,
  name: 'دوره آشپزی',
  type: 'دوره',
  subtype: 'دوره پیشرفته',
  duration: '۴ ماه',
  info: `آموزشگاه آشپزی ما در رشت، تمام امکانات آموزشی را برای شما فراهم کرده است. ما به عنوان یکی از معتبرترین و با تجربه‌ ترین مراکز آموزشی در استان گیلان، دارای بیش از 7 سال سابقه در برگزاری دوره های آموزشی آشپزی در شهر رشت هستیم. اینجا جایی است که شما به تبدیل شدن به یک آشپز حرفه‌ای نزدیک می‌شوید. ما با ارائه دوره‌ های آموزشی که دارای مدرک بین ‌المللی می باشند، شما را به یک سطح بالاتر از مهارت‌های آشپزی می‌رسانیم. از آشنایی با تکنیک ‌های پخت و پز سنتی تا آشنایی با روش‌های جدید و پیشرفته، شما با توجه به علایق و استعداد خود می‌توانید دوره‌ های متنوعی را انتخاب کنید. ما اطمینان داریم که در اینجا، هر فردی به نقطه اوج مهارت‌های خود در آشپزی می‌رسد.`,
  subcourses: ['دوره آشپزی ملل بیسیک', 'دوره آشپزی گیلانی و سنتی', 'دوره صبحانه و برانچ', 'دوره آشپزی ملل پیشرفته', 'دوره سس ها یا سوسیری', 'دوره کباب', 'دوره فینگر فود', 'دوره انواع آش', 'دوره سالاد', 'دوره سوسیس و کالباس', 'دوره استیک', 'دوره پاستا فرش', 'دوره سوشی و غذاهای شرق آسیایی'],
  image: cookingCourseImg,
  url: '/courses/cooking-course',
}

export const fastfoodCourse = {
  id: 2,
  name: 'دوره فست فود',
  type: 'دوره',
  subtype: 'دوره متوسط',
  duration: '۲ ماه',
  info: `آموزشگاه آشپزی ما در رشت، تمام امکانات آموزشی را برای شما فراهم کرده است. ما به عنوان یکی از معتبرترین و با تجربه‌ ترین مراکز آموزشی در استان گیلان، دارای بیش از 7 سال سابقه در برگزاری دوره های آموزشی آشپزی در شهر رشت هستیم. اینجا جایی است که شما به تبدیل شدن به یک آشپز حرفه‌ای نزدیک می‌شوید. ما با ارائه دوره‌ های آموزشی که دارای مدرک بین ‌المللی می باشند، شما را به یک سطح بالاتر از مهارت‌های آشپزی می‌رسانیم. از آشنایی با تکنیک ‌های پخت و پز سنتی تا آشنایی با روش‌های جدید و پیشرفته، شما با توجه به علایق و استعداد خود می‌توانید دوره‌ های متنوعی را انتخاب کنید. ما اطمینان داریم که در اینجا، هر فردی به نقطه اوج مهارت‌های خود در آشپزی می‌رسد.`,
  subcourses: ['دوره سوخاری', 'دوره پیتزا', 'دوره برگر', 'دوره پیتزا ناپولیتن'],
  image: fastfoodCourseImg,
  url: '/courses/fastfood',
}

export const beverageCourse = {
  id: 3,
  name: 'دوره باریستایی',
  type: 'دوره',
  subtype: 'دوره مقدماتی',
  duration: '۳ ماه',
  info: `آموزشگاه آشپزی ما در رشت، تمام امکانات آموزشی را برای شما فراهم کرده است. ما به عنوان یکی از معتبرترین و با تجربه‌ ترین مراکز آموزشی در استان گیلان، دارای بیش از 7 سال سابقه در برگزاری دوره های آموزشی آشپزی در شهر رشت هستیم. اینجا جایی است که شما به تبدیل شدن به یک آشپز حرفه‌ای نزدیک می‌شوید. ما با ارائه دوره‌ های آموزشی که دارای مدرک بین ‌المللی می باشند، شما را به یک سطح بالاتر از مهارت‌های آشپزی می‌رسانیم. از آشنایی با تکنیک ‌های پخت و پز سنتی تا آشنایی با روش‌های جدید و پیشرفته، شما با توجه به علایق و استعداد خود می‌توانید دوره‌ های متنوعی را انتخاب کنید. ما اطمینان داریم که در اینجا، هر فردی به نقطه اوج مهارت‌های خود در آشپزی می‌رسد.`,
  subcourses: ['دوره بار سرد و گرم'],
  image: beverageCourseImg,
  url: '/courses/beverage',
}

export const breadBakingCourse = {
  id: 4,
  name: 'دوره پخت نان',
  type: 'دوره',
  subtype: 'دوره متوسط',
  duration: '۲ ماه',
  info: `آموزشگاه آشپزی ما در رشت، تمام امکانات آموزشی را برای شما فراهم کرده است. ما به عنوان یکی از معتبرترین و با تجربه‌ ترین مراکز آموزشی در استان گیلان، دارای بیش از 7 سال سابقه در برگزاری دوره های آموزشی آشپزی در شهر رشت هستیم. اینجا جایی است که شما به تبدیل شدن به یک آشپز حرفه‌ای نزدیک می‌شوید. ما با ارائه دوره‌ های آموزشی که دارای مدرک بین ‌المللی می باشند، شما را به یک سطح بالاتر از مهارت‌های آشپزی می‌رسانیم. از آشنایی با تکنیک ‌های پخت و پز سنتی تا آشنایی با روش‌های جدید و پیشرفته، شما با توجه به علایق و استعداد خود می‌توانید دوره‌ های متنوعی را انتخاب کنید. ما اطمینان داریم که در اینجا، هر فردی به نقطه اوج مهارت‌های خود در آشپزی می‌رسد.`,
  subcourses: ['دوره نان های حجیم و نیمه حجیم', 'دوره نان های لایه ای و کافه ای', 'دوره نان های خمیر ترش'],
  image: breadBakingCourseImg,
  url: '/courses/breadbaking',
}

export const bakingCourse = {
  id: 5,
  name: 'دوره قنادی',
  type: 'دوره',
  subtype: 'دوره پیشرفته',
  duration: '۳ ماه',
  info: `آموزشگاه آشپزی ما در رشت، تمام امکانات آموزشی را برای شما فراهم کرده است. ما به عنوان یکی از معتبرترین و با تجربه‌ ترین مراکز آموزشی در استان گیلان، دارای بیش از 7 سال سابقه در برگزاری دوره های آموزشی آشپزی در شهر رشت هستیم. اینجا جایی است که شما به تبدیل شدن به یک آشپز حرفه‌ای نزدیک می‌شوید. ما با ارائه دوره‌ های آموزشی که دارای مدرک بین ‌المللی می باشند، شما را به یک سطح بالاتر از مهارت‌های آشپزی می‌رسانیم. از آشنایی با تکنیک ‌های پخت و پز سنتی تا آشنایی با روش‌های جدید و پیشرفته، شما با توجه به علایق و استعداد خود می‌توانید دوره‌ های متنوعی را انتخاب کنید. ما اطمینان داریم که در اینجا، هر فردی به نقطه اوج مهارت‌های خود در آشپزی می‌رسد.`,
  subcourses: ['دوره قنادی ترمیک', 'دوره کیک مجلل عروسی', 'دوره کلوچه فومن و سنتی', 'دوره کیک کافه ای', 'دوره کوکی', 'دوره کیک فوندانت', 'دوره کیک خامه ای', 'دوره حلوا'],
  image: bakingCourseImg,
  url: '/courses/baking',
}

export const baklavaCourse = {
  id: 6,
  name: 'دوره باقلوا پزی',
  type: 'دوره',
  subtype: 'دوره مقدماتی',
  duration: '۱ ماه',
  info: `آموزشگاه آشپزی ما در رشت، تمام امکانات آموزشی را برای شما فراهم کرده است. ما به عنوان یکی از معتبرترین و با تجربه‌ ترین مراکز آموزشی در استان گیلان، دارای بیش از 7 سال سابقه در برگزاری دوره های آموزشی آشپزی در شهر رشت هستیم. اینجا جایی است که شما به تبدیل شدن به یک آشپز حرفه‌ای نزدیک می‌شوید. ما با ارائه دوره‌ های آموزشی که دارای مدرک بین ‌المللی می باشند، شما را به یک سطح بالاتر از مهارت‌های آشپزی می‌رسانیم. از آشنایی با تکنیک ‌های پخت و پز سنتی تا آشنایی با روش‌های جدید و پیشرفته، شما با توجه به علایق و استعداد خود می‌توانید دوره‌ های متنوعی را انتخاب کنید. ما اطمینان داریم که در اینجا، هر فردی به نقطه اوج مهارت‌های خود در آشپزی می‌رسد.`,
  subcourses: ['دوره آموزش باقلوا پزی'],
  image: baklavaCourseImg,
  url: '/courses/baklava',
}

export const courseData = [
  cookingCourse, fastfoodCourse, beverageCourse, breadBakingCourse, bakingCourse, baklavaCourse
]