import { dalgonaCoffeeImg, filletSteakSandwichImg, garlicSoupImg, grilledChickenSandwichImg, lavaCakeRecipeImg } from '../images/food/index'

export const dalgonaCoffee = {
  id: 1,
  name: 'قهوه دالگونا',
  type: 'نوشیدنی',
  info: 'قهوه دالگونا در سال‌های اخیر بسیار ترند شده و به دلیل بافت فومی و خاص و شکل جذاب طرفداران زیادی پیدا کرده. طرز تهیه آن بسیار ساده و سریع است و فقط 3 ماده اولیه لازم دارد. در ادامه طرز تهیه آن را ببینید.',
  ingredients: [{name: 'شکر سفید', amount: 'چهار قاشق غذاخوری'}, {name: 'پودر نسکافه', amount: 'چهار قاشق غذاخوری'}, {name: 'آب جوش', amount: 'چهار قاشق غذاخوری'}, {name: 'شیر', amount: 'یک پیمانه'}],
  image: dalgonaCoffeeImg,
  url: '/food/dalgona-coffee',
  instruction: `طرز تهیه قهوه دالگونا با نسکافه
شکر، نسکافه و آب جوش را مخلوط می‌کنیم:
در یک ظرف شکر، پودر نسکافه و آب جوش را مخلوط می‌کنیم. سپس با همزن برقی یا دستی به مدت ۱۰ دقیقه هم می‌زنیم تا پوک شود و فرم پفکی بگیرد. (با همزن برقی زمان کم‌تری می‌برد)
فوم نسکافه را به شیر اضافه می‌کنیم:
شیر گرم یا سرد را به دلخواه، به اندازه دو سوم لیوان مورد نظر می‌ریزیم و با قاشق فوم نسکافه را به آن اضافه می‌کنیم. اگر می‌خواستید قهوه را سرد سرو کنید درون شیر چند تکه یخ بیندازید.
د‌الگونا را تزیین و سرو می‌کنیم:
می‌توانیم با پودر دارچین یا نسکافه دالگونا را تزیین و سرو کنیم.
نکته: مقدار شکر، نسکافه و آب جوش باید دقیقا یکسان باشند. اگر نسبت ترکیب بهم بخورد فوم دیرتر شکل می‌گیرد یا بافت مناسب را پیدا نمی‌کند.`
}

export const grilledChickenSandwich = {
  id: 2,
  name: 'ساندوچ چیکن گریل',
  type: 'میان‌وعده',
  info: 'ساندویچ چیکن گریل در دسته سالم‌ترین ساندویچ‌ها قرار می‌گیرد. زیرا در طبخ آن از مرغ به عنوان منبع پروتئین استفاده می‌شود',
  ingredients: [{name: 'سینه مرغ', amount: 'صد الی صد و پنجاه گرم'}, {name: 'فلفل سیاه', amount: 'یک قاشق چایخوری'}, {name: 'پودر پاپریکا', amount: 'یک قاشق غذاخوری'}, {name: 'پودر تخم گشنیز', amount: 'نصف قاشق چای خوری'}, {name: 'نمک آرومات', amount: 'یک قاشق چای‌خوری'}, {name:'سیر تازه', amount: 'دو حبه'}, {name: 'رزماری', amount: 'یک شاخه'}, {name: 'روغن زیتون', amount: 'دو قاشق غذاخوری'}, {name: 'گوجه‌فرنگی', amount: 'یک عدد'}, {name: 'خیارشور', amount: 'چهار عدد'}, {name: 'برگ ریحان', amount: 'پنجاه گرم'}, {name: 'سس ساندویچ', amount: 'دو قاشق غذاخوری'}],
  image: grilledChickenSandwichImg,
  url: '/food/grilled-chicken-sandwich',
  instruction: `1. سینه مرغ را مرینیت می‌کنیم: 
گوشت سینه مرغ را در یک ظرف حاوی؛ روغن زیتون، نمک فلفل سیاه، فلفل پاپریکا، رزماری، پودر گشنیز و سیر له شده قرار می‌دهیم و گوشت را به همه مواد آغشته می‌کنیم، زمان می‌دهیم تا سینه مرغ مزه دار شود.

2. سینه مرغ را گریل می‌کنیم: 
سینه مرغ را در تابه یا فر گریل می‌کنیم تا خوب بپزد.

3. سینه مرغ را برش می‌زنیم: 
سینه مرغ گریل سده را به روش استیک برش می‌زنیم.

4. گوجه فرنگی را اماده می‌کنیم: 
گوجه فرنگی را می‌شوییم سپس به صورت حلقه‌ای برش می‌زنیم.

5. خیارشور را آماده می‌کنیم: 
خیارشور را به صورت طولی برش می‌زنیم.

آموزش ساندویچ ژامبون تنوری
6. مواد ساندویچ چیکن گریل را در نان می‌چینیم: 
ابتدا با یک لایه سس ساندویچ لایه داخلی نان را می‌پوشانیم. تکه‌های مرغ را به شکل اریب روی نان قرار می‌دهیم. گوجه‌های حلقه‌ای را روی آن می‌چینیم. خیارشور و برگ ریحان تازه را روی آن قرار می‌دهیم، بخش رویی نان ساندویچ را با سس چیلی می‌پوشانیم و روی آن قرار می‌دهیم.

7. ساندویچ چیکن گریل را سرو می‌کنیم: 
حالا غذای ما آماده است. آن را به همراه سس‌های دلخواه سرو می‌کنیم.`
}

export const filletSteakSandwich = {
  id: 3,
  name: 'ساندویچ فیله استیک',
  type: 'وعده اصلی',
  info: 'ساندویچ فیله استیک یک غذای لذیذ و سرشار از پروتئین است و بسیار مناسب برای پذیرایی در مهمانی‌هایتان. در ادامه با طرز تهیه این غذای خوشمزه همراه ما باشید.',
  ingredients: [{name: 'گوشت فیله گوساله یا راسته', amount: 'صد الی صد و پنجاه گرم'}, {name: 'فلفل سیاه', amount: 'یک قاشق چایخوری'}, {name: 'سیر تازه', amount: 'سه حبه'}, {name: 'رزماری', amount: 'یک شاخه'}, {name: 'روغن زیتون', amount: 'دو قاشق غذاخوری'}, {name:'ریحان', amount: 'بیست گرم'}, {name: 'سس ساندویچ', amount: 'به میزان لازم'}, {name: 'گوجه فرنگی', amount: 'یک عدد'}, {name: 'خیارشور', amount: 'ده عدد'}, {name: 'قارچ', amount: 'چهارصد گرم'}, {name: 'آب لیمو ترش', amount: 'یک قاشق غذاخوری'}, {name: 'پودر سیر', amount: 'یک قاشق چای‌خوری'}, {name: 'خامه', amount: 'یک قاشق غذاخوری'}, {name: 'پنیر چدار رنده شده', amount: 'سه قاشق غذاخوری'}, {name: 'نمک', amount: 'یک قاشق چای‌خوری'}],
  image: filletSteakSandwichImg,
  url: '/food/fillet-steak-sandwich',
  instruction: `فیله گوساله را مرینیت می‌کنیم:
گوشت تازه فیله گوساله یا راسته گوساله را با استفاده از فلفل سیاه، روغن زیتون، سیر له شده و رزماری مرینیت می‌کنیم تا مزه دار شود. در این مرحله نمک را اضافه نمی‌کنیم زیرا باعث سفتی بافت گوشت می‌شود.
فیله گوساله را گریل می‌کنیم:
فیله گوساله را در فر یا کباب پز گریل می‌کنیم تا به خوبی بپزد.
فیله گوساله را برش می‌زنیم:
هنگامی که هر دوطرف گوشت به خوبی گریل شد و خط افتاد با یک چاقوی تیز برش‌های عرضی اریب ایجاد می‌کنیم.
فیله گوساله را سرخ می‌کنیم:
برای اینکه گوشت گوساله به میزان دلخواه بپزد و آب دار باشد. آن‌ها را درون ماهیتابه سرخ می‌کنیم (به دلخواه). و چربی و طعم گوشت درروغن ماهیتابه بماند و به سس مخصوصی که درست می‌کنیم منتقل شود.
قارچ را تفت می‌دهیم:
پس از اینکه فیله را سرخ کردیم. آن‌ها را از ماهیتابه خارج می‌کنیم. روغن را درون ماهیتابه می‌ریزیم و صبر می‌کنیم تا داغ شود سپس قارچ‌هایی که ورقه ورقه خرد کردیم را درون ماهیتابه می‌ریزیم. هنگامیی که یک طرف قارچ سرخ شد ، آن را هم می‌زنیم. وقتی قارچ از حالت خامی در آمد ، آب لیمو ترش تازه، مقداری پودر سیر، فلفل سیاه و نمک را اضافه می‌کنیم و هم می‌زنیم تا قارچ‌ها برشته شوند.`
}

export const garlicSoup = {
  id: 4,
  name: 'سوپ سیر',
  type: 'پیش غذا',
  info: 'در روزهای سرد زمستان و در دوران سرما خوردگی تغذیه خوب در جهت افزایش ایمنی بدن بسیار اهمیت دارد. سوپ سیر یکی از آن غذاهایی است که می‌توانید در این دوران آن را تهیه و نوش جان کنید.',
  ingredients: [{name: 'خامه', amount: 'یک پیمانه'}, {name: 'سیب زمینی متوسط', amount: 'دو عدد'}, {name: 'پیاز', amount: 'یک عدد'}, {name: 'تره فرنگی بزرگ', amount: 'یک عدد'}, {name: 'روغن مایع', amount: 'یک پیمانه'}, {name:'سیر تازه', amount: 'بیست حبه'}, {name: 'اورگانو', amount: 'یک قاشق چایخوری'}, {name: 'عصاره گوشت', amount: 'هفتصد گرم'}, {name: 'نان تست', amount: 'دو عدد'}, {name: 'جعفری', amount: 'نصف پیمانه'}, {name: 'نمک', amount: 'دو قاشق چای خوری'}, {name: 'فلفل سیاه', amount: 'یک قاشق چای خوری'}],
  image: garlicSoupImg,
  url: '/food/garlic-soup',
  instruction: `1. سیب زمینی را خرد می‌کنیم:
سیب زمینی را به شکل حبه قندی خرد می‌کنیم.

2. سیر را گریل می‌کنیم: 
حبه‌های سیر را در فر گریل می‌کنیم تا طعم کبابی بگیرد.

3. نان تست را آماده می‌کنیم: 
هر یک عدد نان تست را به ۹ قسمت تقسیم می‌کنیم، سطح آن را با سیر و کره می‌پوشانیم و در فر برشته می‌کنیم. برای تزیین و سرو در کنار سوپ سیر بسیار لذیذ می‌شود.

4. پیاز را عسلی می‌کنیم: 
پیاز را نگینی خرد می‌کنیم، در روغن داغ تفت می‌دهیم تا عسلی رنگ شود.

5. تره فرنگی را خرد می‌کنیم و تفت می‌دهیم: 
تره فرنگی را برش طولی می‌زنیم و تمیز می‌شوییم. سپس خرد می‌کنیم و درون پیاز تفت می‌دهیم.

6. سیر را تفت می‌دهیم: 
حبه‌های گریل شده سیر را درون پیاز و تره فرنگی تفت می‌دهیم.

7. ادویه‌ها را اضافه می‌کنیم: 
فلفل سیاه، اورگانو یا آویشن و مقداری نمک به قابلمه اضافه می‌کنیم و هم می‌زنیم.`
}

export const lavaCakeRecipe = {
  id: 5,
  name: 'لاوا کیک',
  type: 'دسر و سالاد',
  info: 'لاوا کیک بسیار محبوب است زیرا بافت میانی کیک مملو از شکلات مذاب و نرم است که حین برش کیک بیرون می‌ریزد و آن را هیجان انگیز می‌کند. در ادامه دستور پخت این کیک منحصر به فرد را ملاحظه می‌کنید.',
  ingredients: [{name: 'شکلات سکه‌ای تلخ', amount: 'صد و پنجاه گرم'}, {name: 'کره', amount: 'صد و پنجاه گرم'}, {name: 'آرد', amount: 'یک پیمانه استاندارد'}, {name: 'پودر شکر یا شکر گرانول', amount: 'یک پیمانه استاندارد'}, {name: 'پودر شکلات', amount: 'شش قاشق غذاخوری'}, {name:'عصاره وانیل', amount: 'یک قاشق مرباخوری'}, {name: 'تخم مرغ', amount: 'سه عدد'}, {name: 'زرده تخم مرغ', amount: 'سه عدد'}],
  image: lavaCakeRecipeImg,
  url: '/food/lava-cake',
  instruction: `کره و شکلات را با هم ذوب و مخلوط می‌کنیم:
به روش بن ماری کره را آب می‌کنیم و شکلات‌های سکه‌ای را به ظرف اضافه می‌کنیم تا با هم مخلوط و ذوب شوند.
شکر را با وانیل، تخم مرغ‌ها و زرده تخم مرغ ترکیب می‌کنیم:
تخم مرغ‌ها را در ظرف هم زن می‌شکنیم، زرده‌ها را اضافه می‌کنیم، سپس پودر شکر و وانیل را اضافه می‌کنیم و با دور تند هم زن را روشن می‌کنیم تا ترکیبی کرمی رنگ روشن حاصل شود. بلافاصله هم زن را خاموش می‌کنیم که بافت آن خراب نشود.
پودر شکلات را با ترکیب کره و شکلات مخلوط می‌کنیم:
هنگامی که کره و شکلات‌ها به خوبی ترکیب شدند، آن را از روی حرارت بن ماری برمی‌داریم، پودر شکلات را اضافه می‌کنیم و هم می‌زنیم تا یکدست شود.
ترکیب شکلات را با ترکیب تخم مرغ مخلوط می‌کنیم:
ترکیب شکلات را به مخلوط تخم مرغ درون ظرف هم زن اضافه می‌کنیم و با سرعت کم هم می‌زنیم تا مخلوط شوند. وقتی به خوبی ترکیب شدند هم زن را خاموش می‌کنیم از هم زدن اضافه خودداری می‌کنیم.`
}



export const foodData = [
  dalgonaCoffee, grilledChickenSandwich, filletSteakSandwich, garlicSoup, lavaCakeRecipe
]