import { dalgonaCoffeeImg, filletSteakSandwichImg, garlicSoupImg, grilledChickenSandwichImg, lavaCakeRecipeImg } from '../images/food/index'

export const dalgonaCoffee = {
  id: 1,
  name: 'قهوه دالگونا',
  type: 'نوشیدنی',
  info: 'قهوه دالگونا در سال‌های اخیر بسیار ترند شده و به دلیل بافت فومی و خاص و شکل جذاب طرفداران زیادی پیدا کرده. طرز تهیه آن بسیار ساده و سریع است و فقط 3 ماده اولیه لازم دارد. در ادامه طرز تهیه آن را ببینید.',
  ingredients: [{name: 'شکر سفید', amount: 'چهار قاشق غذاخوری'}, {name: 'پودر نسکافه', amount: 'چهار قاشق غذاخوری'}, {name: 'آب جوش', amount: 'چهار قاشق غذاخوری'}, {name: 'شیر', amount: 'یک پیمانه'}],
  image: dalgonaCoffeeImg,
  instruction: `طرز تهیه قهوه دالگونا با نسکافه
شکر، نسکافه و آب جوش را مخلوط می‌کنیم:
در یک ظرف شکر، پودر نسکافه و آب جوش را مخلوط می‌کنیم. سپس با همزن برقی یا دستی به مدت ۱۰ دقیقه هم می‌زنیم تا پوک شود و فرم پفکی بگیرد. (با همزن برقی زمان کم‌تری می‌برد)
فوم نسکافه را به شیر اضافه می‌کنیم:
شیر گرم یا سرد را به دلخواه، به اندازه دو سوم لیوان مورد نظر می‌ریزیم و با قاشق فوم نسکافه را به آن اضافه می‌کنیم. اگر می‌خواستید قهوه را سرد سرو کنید درون شیر چند تکه یخ بیندازید.
د‌الگونا را تزیین و سرو می‌کنیم:
می‌توانیم با پودر دارچین یا نسکافه دالگونا را تزیین و سرو کنیم.
نکته: مقدار شکر، نسکافه و آب جوش باید دقیقا یکسان باشند. اگر نسبت ترکیب بهم بخورد فوم دیرتر شکل می‌گیرد یا بافت مناسب را پیدا نمی‌کند.`
}

export const foodData = [
  dalgonaCoffee
]